{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "CustomTransformerModel",
    "parent_library": "__main__"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "decoder.layers.0.out_proj",
    "decoder.layers.3.linear1",
    "decoder.layers.2.linear1",
    "fc_out",
    "decoder.layers.3.linear2",
    "decoder.layers.2.out_proj",
    "decoder.layers.1.out_proj",
    "decoder.layers.1.linear1",
    "decoder.layers.0.linear1",
    "decoder.layers.3.out_proj",
    "decoder.layers.0.linear2",
    "decoder.layers.2.linear2",
    "decoder.layers.1.linear2"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}